In [1]:
import pandas as pd

In [2]:
import numpy

# 5.1 Introduction to pandas Data Structures

### Series

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

**Trying a bold markdown**

*Italic*

# Heading 1

## HEADING 2

# Quick Reminder on Markdown
### Use different amounts of pound signs for different heading emphasis
## Basic text formatting:
To make text **bold**, or *italic*, or ***bold and italic*** use stars.
> To make a block quote, use a carrot in the front

1. Lists can be made
1. With the same or different number each time
1. It will automatically renumber

- A single dash
- can be used
- for a bullet point list

Remember to set the cell type from Code to Markdown
and press the **Run** button to apply the formating.

The keyboard shortcut for markdown is m/M after intiating a new cell.

### SERIES

The default index starts at 0

In [5]:
obj. values

array([ 4,  7, -5,  3])

.index describes the 3 'S' of range

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

To assign value keys to the index:

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index= ['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Can use single or sets of values:

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6

In [12]:
obj2[['c', 'a', 'd',]]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In the following dict I entered the data as in the book, but theirs organized alphabetically, and mine stayed i entry order.

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'

In [32]:
obj4.index.name = 'state'

In [33]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [35]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [36]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DATAFRAME

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada','Nevada','Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [38]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [40]:
pd. DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [41]:
frame2 = pd.DataFrame(data, columns= ['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])

In [42]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

m/M Retrieve a column with dict notation, or by attribute

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [47]:
frame2['debt'] = 16.5

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [49]:
frame2['debt'] = np.arange(6.)

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [52]:
frame2['debt'] = val

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

^That one didn't work at first, because the mode of the cell got changed to "raw as opposed to "Code".

In [54]:
frame2['eastern'] = frame2.state == 'Ohio'

In [55]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [56]:
frame2['eastern'] = frame2.state == 'Ohio'

In [57]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [59]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
frame3 = pd.DataFrame(pop)

In [61]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
frame3.index.name = 'year'

In [63]:
frame3

      Nevada  Ohio
year
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [64]:
frame3.T

year    2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [65]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [66]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [67]:
pd.DataFrame(pdata)

      Ohio  Nevada
year
2001   1.7     2.4
2002   3.6     2.9

In [68]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [69]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [70]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [71]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, True],
       [2001, 'Ohio', 1.7, -1.2, True],
       [2002, 'Ohio', 3.6, nan, True],
       [2001, 'Nevada', 2.4, -1.5, False],
       [2002, 'Nevada', 2.9, -1.7, False],
       [2003, 'Nevada', 3.2, nan, False]], dtype=object)

In [72]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [73]:
index = obj.index

In [74]:
index

Index(['a', 'b', 'c'], dtype='object')

In [75]:
index[1:]

Index(['b', 'c'], dtype='object')

In [76]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index= labels)

In [ ]:
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [ ]:
obj3

In [ ]:
obj3.reindex(range(6), method= 'ffill')

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [ ]:
frame

In [ ]:
frame2= frame.reindex(['a', 'b', 'c', 'd'])

In [ ]:
frame2

In [ ]:
states= ['Texas', 'Utah', 'California']

In [ ]:
frame.reindex(columns=states)

In [ ]:
frame.loc[['a', 'b', 'c', 'd'], states]

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj

In [ ]:
new_obj = obj.drop('c')

In [ ]:
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis= 'columns')

In [ ]:
obj.drop('c', inplace=True)

## Inplace drops the data in the column

In [ ]:
obj

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj

In [ ]:
obj['b']

In [ ]:
obj[1]

In [ ]:
obj[2:4]

In [ ]:
obj[['b', 'a', 'd']]

In [ ]:
obj[[1,3]]

In [ ]:
obj[obj < 2]

In [ ]:
obj['b':'c']

In [ ]:
obj['b':'c'] = 5

In [ ]:
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data['two']

In [ ]:
data[['three', 'one']]

In [ ]:
data[:2]

In [ ]:
data[data['three'] > 5]

## This is interesting because it's a boolean, not returning the values that are lesss than 5, just whether or not the value is less than 5!

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0

In [ ]:
data

In [ ]:
data.loc['Colorado', ['two', 'three']]

## In the iloc query the first index is the column, and the second nested index is the row

In [ ]:
data.iloc[2, [3, 0, 1]]

In [ ]:
data.iloc[2]

## For searching row and column axis, both have to be encapsulated in an outside bracket

In [ ]:
data.iloc[[1,2], [3, 0, 1]]

## What data lies between [0] and [Utah] in the state column as well as the two column

In [ ]:
data.loc[:'Utah', 'two']

## Collection of data encompassed by three from the end, and as far as column three

In [ ]:
data.iloc[:, :3][data.three > 5]

## The wrong way to do things

In [ ]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

## Integer Indexes have potential for ambiguity

In [ ]:
ser

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [ ]:
ser2[-1]

In [ ]:
ser[:1]

In [ ]:
ser.loc[:1]

In [ ]:
ser.iloc[:1]

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

In [ ]:
s2

In [ ]:
s1+s2

In [ ]:
df1= pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df2= pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1+df2

In [ ]:
df1 = pd.DataFrame({'A': [1,2]})

In [ ]:
df2 = pd.DataFrame({'B': [3,4]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1 - df2

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd'))

In [ ]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns=list('abcde'))

In [ ]:
df2.loc[1,'b'] = np.nan

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1+df2

In [ ]:
df1.add(df2, fill_value=0)

In [ ]:
1/df1

In [ ]:
df1.reindex(columns=df2.columns, fill_value=0)

In [ ]:
arr = np.arange(12.).reshape((3,4))

In [ ]:
arr

In [ ]:
arr[0]

In [ ]:
arr - arr[0]

In [ ]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
series = frame.iloc[0]

In [ ]:
frame

## Because this variable refers to a specific row, calling the variable returns the row

In [ ]:
series

In [ ]:
frame - series

In [ ]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [ ]:
frame + series2

In [ ]:
series3 = frame['d']

In [ ]:
frame

In [ ]:
series3

In [ ]:
frame.sub(series3, axis='index')

In [ ]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), 
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame

In [ ]:
np.abs(frame)

In [ ]:
f = lambda x: x.max() - x.min()

In [ ]:
frame.apply(f)

In [ ]:
frame.apply(f, axis= 'columns')

In [ ]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [ ]:
frame.apply(f)

In [ ]:
format = lambda x: '%.2f'% x

In [ ]:
frame.map(format)

In [ ]:
frame['e'].map(format)

In [ ]:
obj = pd.Series(range(4), 
                index=['d', 'a', 'b', 'c'])

In [ ]:
obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])

In [ ]:
frame.sort_index()

In [ ]:
frame.sort_index(axis=1)

In [ ]:
frame.sort_index(axis=1, ascending=False)

In [ ]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj.sort_values()

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [ ]:
obj.sort_values()

## In the demonstration it shows a return of a b, but shouldn't, given the order. I changed it for clarity.

In [ ]:
frame = pd.DataFrame({'a': [0, 1, 0, 1], 'b': [4, 7, -3, 2]})

In [ ]:
frame

In [ ]:
frame.sort_values(by='b')

## Sort by multi columns with list of names

In [ ]:
frame.sort_values(by=['a', 'b'])

## Ranking assigns ranks from one through the calid data points in array. Ties broken by assigning mean rank

In [ ]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj.rank()

## By the order in which the values are observed in the data

In [ ]:
obj.rank(method='first')

## Assign tie values to max rank in the group.

In [ ]:
obj.rank(ascending=False, method='max')

## Same problem as before, the instructions and results didnt match for setting up the table. I chose to go with the results

In [ ]:
frame = pd.DataFrame({'a': [0, 1, 0, 1], 'b':[4.3, 7, -3, 2], 'c': [-2, 5, 8, -2.5]})

In [ ]:
frame

In [ ]:
frame.rank(axis='columns')

# 'average' 
Default: assign the average rank to each entry in the equal group
# 'min' 
Use the minimum rank for the whole group
# 'max' 
Use the maximum rank for the whole group
# 'first' 
Assign ranks in the order the values appear in the data
# 'dense' 
Like method='min', but ranks always increase by 1 in between groups rather than the number of equal elements in a group

# AXIS INDEXES with DUPLICATE LABELS

In [ ]:
obj= pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [ ]:
obj

In [ ]:
obj.index.is_unique

In [ ]:
obj['a']

In [ ]:
obj['c']

In [ ]:
df= pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

In [ ]:
df

In [ ]:
df.loc['b']

## SUMMARIZING and COMPUTING DESCRIPTIVE STATISTICS
Methods to remove single summary values

In [ ]:
df= pd.DataFrame([[1.4, np.nan], [7.1, -4.5], 
                 [np.nan, np.nan], [0.75, -1.3]],
                index=['a', 'b', 'c', 'd'], 
                columns=['one', 'two'])

In [ ]:
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis='columns', skipna=False)

# axis 
Axis to reduce over; 0 for DataFrames rows and 1 for columns
# skipna 
Exclude missing values;Trueby default
# level 
Reduce grouped by level if the axis is hierarchically indexed (MultiIndex)

Below, methods like idxmin and idxmax return indirect statistics like the index value where the min or max values are attained:

In [ ]:
df.idxmax()

Cumulative sum.

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
obj = pd.Series(['a', 'a', 'b', 'c']*4)

In [ ]:
obj.describe()

# count
Number of non-NA values
# describe
Compute set of summary statistics for Series or each DataFrame column
# min, max 
Compute minimum and maximum values
# argmin, argmax 
Compute index locations (integers) at which minimum or maximum value obtained, respectively
# idxmin, idxmax 
Compute index labels at which minimum or maximum value obtained, respectively
# quantile
Compute sample quantile ranging from 0 to 1
# sum
Sum of values
# mean
Mean of values
# median
Arithmetic median (50% quantile) of values
# mad
Mean absolute deviation from mean value
# prod
Product of all values
# var
Sample variance of values
# std
Sample standard deviation of values
# skew
Sample skewness (third moment) of values
# kurt
Sample kurtosis (fourth moment) of values
# cumsum
Cumulative sum of values
# cummin, cummax 
Cumulative minimum or maximum of values, respectively
# cumprod
Cumulative product of values
# diff
Compute first arithmetic difference (useful for time series)
# pct_change
Compute percent changes

Covariance below is computed from pairs of arguments

In [ ]:
conda install pandas-datareader

In [77]:
import pandas_datareader.data as web

In [81]:
import datetime as dt

In [89]:
pip install "yfinance[optional]"

Collecting yfinance[optional]
  Downloading yfinance-0.2.37-py2.py3-none-any.whl.metadata (11 kB)
WARNING: yfinance 0.2.37 does not provide the extra 'optional'
Requirement already satisfied: pandas>=1.3.0 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2.2.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (1.26.4)
Requirement already satisfied: requests>=2.31 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2.31.0)
Collecting multitasking>=0.0.7 (from yfinance[optional])
  Downloading multitasking-0.0.11-py3-none-any.whl.metadata (5.5 kB)
Requirement already satisfied: lxml>=4.9.1 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (5.1.0)
Collecting appdirs>=1.4.4 (from yfinance[optional])
  Downloading appdirs-1.4.4-py2.py3-none-any.whl.metadata (9.0 kB)
Requirement already satisfied: pytz>=2022.5 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2024.1)
Collecting frozendict>=2.3.4 (from yfinance[optional])
  Downloading frozendict-2.4.1.tar.gz (315 kB)
      315.2/315.2 kB 6.9 MB/s eta 0:00:00a 0:00:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Collecting peewee>=3.16.2 (from yfinance[optional])
  Downloading peewee-3.17.1.tar.gz (3.0 MB)
      3.0/3.0 MB 11.0 MB/s eta 0:00:0000:0100:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: beautifulsoup4>=4.11.1 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (4.12.3)
Collecting html5lib>=1.1 (from yfinance[optional])
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: soupsieve>1.2 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from beautifulsoup4>=4.11.1->yfinance[optional]) (2.5)
Requirement already satisfied: six>=1.9 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib>=1.1->yfinance[optional]) (1.16.0)
Requirement already satisfied: webencodings in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib>=1.1->yfinance[optional]) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance[optional]) (2.9.0)
Requirement already satisfied: tzdata>=2022.7 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance[optional]) (2024.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (3.6)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (2.2.1)
Requirement already satisfied: certifi>=2017.4.17 in /Users/lydia/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (2024.2.2)
Downloading appdirs-1.4.4-py2.py3-none-any.whl (9.6 kB)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
    112.2/112.2 kB 9.8 MB/s eta 0:00:00
Downloading multitasking-0.0.11-py3-none-any.whl (8.5 kB)
Downloading yfinance-0.2.37-py2.py3-none-any.whl (72 kB)
    73.0/73.0 kB 5.2 MB/s eta 0:00:00
Building wheels for collected packages: frozendict, peewee
  Building wheel for frozendict (pyproject.toml) ... done
  Created wheel for frozendict: filename=frozendict-2.4.1-cp312-cp312-macosx_11_0_arm64.whl size=15503 sha256=7eb9a9be456a43cf9c42237552d60b41cf7b8d0280bdc94bc73d4cda21dd3aad
  Stored in directory: /Users/lydia/Library/Caches/pip/wheels/a1/2a/ed/313e8c375a307e932fb57a79e12194d3e0fa64748459a76094
  Building wheel for peewee (pyproject.toml) ... done
  Created wheel for peewee: filename=peewee-3.17.1-py3-none-any.whl size=136905 sha256=252d2a99c60de9d07b0d3c5fdb778db099e31368f9aa0209df14073c7637f8a3
  Stored in directory: /Users/lydia/Library/Caches/pip/wheels/fe/58/f4/132ded03aa364dd5d2bbc2d02e1c2074a9b5012776d15fc2dc
Successfully built frozendict peewee
Installing collected packages: peewee, multitasking, appdirs, html5lib, frozendict, yfinance
Successfully installed appdirs-1.4.4 frozendict-2.4.1 html5lib-1.1 multitasking-0.0.11 peewee-3.17.1 yfinance-0.2.37
Note: you may need to restart the kernel to use updated packages.

In [1]:
import yfinance as yf

In [3]:
msft = yf.Ticker("MSFT")

In [4]:
tickers = yf.Tickers('msft ibm aapl goog')

In [5]:
tickers.tickers['MSFT'].info

{'address1': 'One Microsoft Way',
 'city': 'Redmond',
 'state': 'WA',
 'zip': '98052-6399',
 'country': 'United States',
 'phone': '425 882 8080',
 'website': 'https://www.microsoft.com',
 'industry': 'Software - Infrastructure',
 'industryKey': 'software-infrastructure',
 'industryDisp': 'Software - Infrastructure',
 'sector': 'Technology',
 'sectorKey': 'technology',
 'sectorDisp': 'Technology',
 'longBusinessSummary': 'Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.',
 'fullTimeEmployees': 221000,
 'companyOfficers': [{'maxAge': 1,
   'name': 'Mr. Satya  Nadella',
   'age': 56,
   'title': 'Chairman & CEO',
   'yearBorn': 1967,
   'fiscalYear': 2023,
   'totalPay': 9276400,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Bradford L. Smith LCA',
   'age': 64,
   'title': 'President & Vice Chairman',
   'yearBorn': 1959,
   'fiscalYear': 2023,
   'totalPay': 3591277,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Ms. Amy E. Hood',
   'age': 51,
   'title': 'Executive VP & CFO',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'totalPay': 3452196,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Judson B. Althoff',
   'age': 49,
   'title': 'Executive VP & Chief Commercial Officer',
   'yearBorn': 1974,
   'fiscalYear': 2023,
   'totalPay': 3355797,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Christopher David Young',
   'age': 51,
   'title': 'Executive Vice President of Business Development, Strategy & Ventures',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'totalPay': 2460507,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Ms. Alice L. Jolla',
   'age': 56,
   'title': 'Corporate VP & Chief Accounting Officer',
   'yearBorn': 1967,
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. James Kevin Scott',
   'age': 51,
   'title': 'Executive VP of AI & CTO',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Brett  Iversen',
   'title': 'Vice President of Investor Relations',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Hossein  Nowbar',
   'title': 'Chief Legal Officer',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Frank X. Shaw',
   'title': 'Chief Communications Officer',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0}],
 'auditRisk': 2,
 'boardRisk': 5,
 'compensationRisk': 2,
 'shareHolderRightsRisk': 2,
 'overallRisk': 1,
 'governanceEpochDate': 1711929600,
 'compensationAsOfEpochDate': 1703980800,
 'irWebsite': 'http://www.microsoft.com/investor/default.aspx',
 'maxAge': 86400,
 'priceHint': 2,
 'previousClose': 424.57,
 'open': 420.11,
 'dayLow': 417.842,
 'dayHigh': 422.38,
 'regularMarketPreviousClose': 424.57,
 'regularMarketOpen': 420.11,
 'regularMarketDayLow': 417.842,
 'regularMarketDayHigh': 422.38,
 'dividendRate': 3.0,
 'dividendYield': 0.0070999996,
 'exDividendDate': 1715731200,
 'payoutRatio': 0.2523,
 'fiveYearAvgDividendYield': 0.95,
 'beta': 0.89,
 'trailingPE': 38.036102,
 'forwardPE': 31.521317,
 'volume': 17722802,
 'regularMarketVolume': 17722802,
 'averageVolume': 22740970,
 'averageVolume10days': 18147009,
 'averageDailyVolume10Day': 18147009,
 'bid': 386.34,
 'ask': 453.57,
 'bidSize': 200,
 'askSize': 200,
 'marketCap': 3131484667904,
 'fiftyTwoWeekLow': 275.37,
 'fiftyTwoWeekHigh': 430.82,
 'priceToSalesTrailing12Months': 13.7597475,
 'fiftyDayAverage': 411.823,
 'twoHundredDayAverage': 363.57272,
 'trailingAnnualDividendRate': 2.86,
 'trailingAnnualDividendYield': 0.006736227,
 'currency': 'USD',
 'enterpriseValue': 3185116184576,
 'profitMargins': 0.36269,
 'floatShares': 7418919053,
 'sharesOutstanding': 7430439936,
 'sharesShort': 54210656,
 'sharesShortPriorMonth': 42451775,
 'sharesShortPreviousMonthDate': 1707955200,
 'dateShortInterest': 1710460800,
 'sharesPercentSharesOut': 0.0073,
 'heldPercentInsiders': 0.00054000004,
 'heldPercentInstitutions': 0.73847,
 'shortRatio': 2.46,
 'shortPercentOfFloat': 0.0073,
 'impliedSharesOutstanding': 7430439936,
 'bookValue': 32.06,
 'priceToBook': 13.145352,
 'lastFiscalYearEnd': 1688083200,
 'nextFiscalYearEnd': 1719705600,
 'mostRecentQuarter': 1703980800,
 'earningsQuarterlyGrowth': 0.332,
 'netIncomeToCommon': 82541002752,
 'trailingEps': 11.08,
 'forwardEps': 13.37,
 'pegRatio': 2.24,
 'lastSplitFactor': '2:1',
 'lastSplitDate': 1045526400,
 'enterpriseToRevenue': 13.995,
 'enterpriseToEbitda': 26.895,
 '52WeekChange': 0.4783411,
 'SandP52WeekChange': 0.27878118,
 'lastDividendValue': 0.75,
 'lastDividendDate': 1707868800,
 'exchange': 'NMS',
 'quoteType': 'EQUITY',
 'symbol': 'MSFT',
 'underlyingSymbol': 'MSFT',
 'shortName': 'Microsoft Corporation',
 'longName': 'Microsoft Corporation',
 'firstTradeDateEpochUtc': 511108200,
 'timeZoneFullName': 'America/New_York',
 'timeZoneShortName': 'EDT',
 'uuid': 'b004b3ec-de24-385e-b2c1-923f10d3fb62',
 'messageBoardId': 'finmb_21835',
 'gmtOffSetMilliseconds': -14400000,
 'currentPrice': 421.44,
 'targetHighPrice': 550.0,
 'targetLowPrice': 298.1,
 'targetMeanPrice': 460.92,
 'targetMedianPrice': 462.0,
 'recommendationMean': 1.7,
 'recommendationKey': 'buy',
 'numberOfAnalystOpinions': 48,
 'totalCash': 80981999616,
 'totalCashPerShare': 10.899,
 'ebitda': 118427000832,
 'totalDebt': 111358001152,
 'quickRatio': 1.096,
 'currentRatio': 1.218,
 'totalRevenue': 227583000576,
 'debtToEquity': 46.736,
 'revenuePerShare': 30.612,
 'returnOnAssets': 0.1519,
 'returnOnEquity': 0.39174,
 'freeCashflow': 58680999936,
 'operatingCashflow': 102646996992,
 'earningsGrowth': 0.332,
 'revenueGrowth': 0.176,
 'grossMargins': 0.69815004,
 'ebitdaMargins': 0.52037,
 'operatingMargins': 0.43585998,
 'financialCurrency': 'USD',
 'trailingPegRatio': 2.1532}